[
 {
   "nis2_ref": 1,
   "framework": "ISO 27001",
   "code": "6.1",
   "priority": null,
   "category": "Analisi dei rischi e delle opportunità",
   "sub_category": null,
   "description": "Vengono Identificati, valutati e gestiti rischi e opportunità per la sicurezza delle informazioni, monitorando e riesaminando l'efficacia dei processi di gestione del rischio.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 1,
   "framework": "ISO 27001",
   "code": "A5.31",
   "priority": null,
   "category": "Identificazione dei requisiti legali e statutari",
   "sub_category": null,
   "description": "I requisiti legali, statutari, normativi e contrattuali relativi alla sicurezza delle informazioni e l'approccio dell'organizzazione per soddisfare tali requisiti sono   identificati, documentati e mantenuti aggiornati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 1,
   "framework": "ISO 27001",
   "code": "A6.4",
   "priority": null,
   "category": "Processo disciplinare",
   "sub_category": null,
   "description": "Viene formalizzato e comunicato un procedimento disciplinare per intraprendere azioni nei confronti del personale e delle altre parti interessate rilevanti che hanno commesso una violazione della politica di sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 2,
   "framework": "ISO 27001",
   "code": "7.2",
   "priority": null,
   "category": "Competenza",
   "sub_category": null,
   "description": "L'organizzazione ha garantito la competenza delle persone che influiscono sulla sicurezza delle informazioni, acquisendo le necessarie competenze, valutando l'efficacia delle azioni intraprese e conservando la documentazione come prova.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 2,
   "framework": "ISO 27001",
   "code": "7.4",
   "priority": null,
   "category": "Consapevolezza",
   "sub_category": null,
   "description": "L'organizzazione ha determinato la necessità di comunicazioni interne ed esterne relative al sistema di gestione della sicurezza delle informazioni, stabilendo cosa, quando, con chi e come comunicare.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "8.1",
   "priority": null,
   "category": "Pianificazione e controllo operativi",
   "sub_category": null,
   "description": "Vengono documentati i processi, gestiti i cambiamenti pianificati e mitigati quelli imprevisti. Vengono inoltre controllati i processi, prodotti o servizi esterni rilevanti per il sistema di gestione della sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "8.2",
   "priority": null,
   "category": "Valutazione del rischio relativo alla sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha eseguito valutazioni del rischio per la sicurezza delle informazioni a intervalli pianificati o quando si sono verificati cambiamenti significativi. Ha inoltre conservato la documentazione dei risultati delle valutazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "8.3",
   "priority": null,
   "category": "Trattamento del rischio relativi alla sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha attuato il piano di trattamento del rischio per la sicurezza delle informazioni e ha conservato la documentazione dei risultati del trattamento.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "9.3",
   "priority": null,
   "category": "Riesame della direzione",
   "sub_category": null,
   "description": "La direzione deve esaminare regolarmente il sistema di gestione della sicurezza delle informazioni, considerando azioni precedenti, cambiamenti rilevanti, prestazioni di sicurezza, audit e opportunità di miglioramento. I risultati devono documentare decisioni su miglioramenti e modifiche necessarie, con prove disponibili.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "A5.34",
   "priority": null,
   "category": "Privacy e protezione dei dati personali",
   "sub_category": null,
   "description": "L'organizzazione ha identificato e soddisfatto i requisiti relativi alla tutela della privacy e alla protezione delle PII secondo le leggi e i regolamenti applicabili e i requisiti contrattuali.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "A5.35",
   "priority": null,
   "category": "Riesame indipendente della sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'approccio dell'organizzazione alla gestione della sicurezza delle informazioni e alla sua implementazione, comprese le persone, i processi e le tecnologie, viene rivisto in modo indipendente a intervalli pianificati o quando si sono verificati cambiamenti significativi.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 3,
   "framework": "ISO 27001",
   "code": "A5.36",
   "priority": null,
   "category": "Conformità a politiche, regole e standard per la sicurezza delle informazioni",
   "sub_category": null,
   "description": "Il rispetto della politica di sicurezza delle informazioni dell'organizzazione, delle politiche, delle regole e degli standard specifici per argomento viene regolarmente rivisto.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 4,
   "framework": "ISO 27001",
   "code": "A5.2",
   "priority": null,
   "category": "Ruoli e responsabilità per la sicurezza delle informazioni",
   "sub_category": null,
   "description": "I ruoli e le responsabilità in materia di sicurezza delle informazioni sono definiti e assegnati in base alle esigenze dell'organizzazione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 4,
   "framework": "ISO 27001",
   "code": "A5.31",
   "priority": null,
   "category": "Politiche per la sicurezza delle informazioni",
   "sub_category": null,
   "description": "I requisiti legali, statutari, normativi e contrattuali relativi alla sicurezza delle informazioni e l'approccio dell'organizzazione per soddisfare tali requisiti sono identificati, documentati e mantenuti aggiornati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "10.2",
   "priority": null,
   "category": "Non conformità ed azioni correttive",
   "sub_category": null,
   "description": "Le azioni correttive sono appropriate agli effetti delle non conformità riscontrate, con documentazione disponibile a prova della natura delle non conformità e dei risultati delle azioni correttive.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.24",
   "priority": null,
   "category": "Pianificazione e preparazione della gestione degli incidenti di sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha pianificato e si è preparata per la gestione degli incidenti di sicurezza delle informazioni definendo, stabilendo e comunicando i processi, i ruoli e le responsabilità di gestione degli incidenti di sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.25",
   "priority": null,
   "category": "Valutazione e decisione sugli eventi di sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha valutato gli eventi di sicurezza delle informazioni e deciso se sono stati classificati come incidenti di sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.26",
   "priority": null,
   "category": "Risposta agli incidenti di sicurezza delle informazioni",
   "sub_category": null,
   "description": "Si è dovuto rispondere agli incidenti legati alla sicurezza delle informazioni in conformità con le procedure documentate.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.27",
   "priority": null,
   "category": "Imparare dagli incidenti di sicurezza delle informazioni",
   "sub_category": null,
   "description": "Le conoscenze acquisite dagli incidenti relativi alla sicurezza delle informazioni sono utilizzate per rafforzare e migliorare i controlli sulla sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.28",
   "priority": null,
   "category": "Raccolta delle prove",
   "sub_category": null,
   "description": "L'organizzazione ha stabilito e implementato procedure per l'identificazione, la raccolta, l'acquisizione e la conservazione delle prove relative agli eventi di sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 5,
   "framework": "ISO 27001",
   "code": "A5.5",
   "priority": null,
   "category": "Contatti con autorità",
   "sub_category": null,
   "description": "L'organizzazione ha stabilito e mantenuto contatti con le autorità competenti.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A5.29",
   "priority": null,
   "category": "Sicurezza delle informazioni durante le interruzioni",
   "sub_category": null,
   "description": "L'organizzazione ha pianificato come mantenere la sicurezza delle informazioni ad un livello adeguato durante l'interruzione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A5.30",
   "priority": null,
   "category": "Prontezza dell'ICT per la continuità operativa",
   "sub_category": null,
   "description": "La preparazione ICT viene pianificata, implementata, mantenuta e testata sulla base degli obiettivi di continuità operativa e dei requisiti di continuità ICT.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A5.7",
   "priority": null,
   "category": "Threats intelligence",
   "sub_category": null,
   "description": "Le informazioni relative alle minacce alla sicurezza delle informazioni vengono raccolte e analizzate per produrre informazioni sulle minacce.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A8.13",
   "priority": null,
   "category": "Back-up delle informazioni",
   "sub_category": null,
   "description": "Le copie di backup di informazioni, software e sistemi vengono mantenute e testate regolarmente in conformità con la politica concordata sull'argomento specifico sul backup.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A8.14",
   "priority": null,
   "category": "Ridondanza delle strutture di elaborazione delle informazioni",
   "sub_category": null,
   "description": "Le strutture di elaborazione delle informazioni vengono implementate con una ridondanza sufficiente a soddisfare i requisiti di disponibilità.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A8.15",
   "priority": null,
   "category": "Raccolta dei log",
   "sub_category": null,
   "description": "Registri che registrano attività, eccezioni, guasti e altri eventi rilevanti sono prodotti, conservati, protetti e analizzati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 6,
   "framework": "ISO 27001",
   "code": "A8.16",
   "priority": null,
   "category": "Attività di monitoraggio",
   "sub_category": null,
   "description": "Le reti, i sistemi e le applicazioni sono monitorati per comportamenti anomali e vengono intraprese azioni appropriate per valutare potenziali incidenti di sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A5.19",
   "priority": null,
   "category": "Sicurezza delle informazioni nei rapporti con i fornitori",
   "sub_category": null,
   "description": "Vengono definiti e implementati processi e procedure per gestire i rischi per la sicurezza delle informazioni associati all'uso dei prodotti o servizi del fornitore.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A5.20",
   "priority": null,
   "category": "Affrontare la sicurezza delle informazioni negli accordi con i fornitori",
   "sub_category": null,
   "description": "I pertinenti requisiti di sicurezza delle informazioni sono stabiliti e concordati con ciascun fornitore in base al tipo di rapporto con il fornitore.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A5.21",
   "priority": null,
   "category": "Gestire la sicurezza delle informazioni nella filiera ICT",
   "sub_category": null,
   "description": "Vengono definiti e implementati processi e procedure per gestire i rischi di sicurezza delle informazioni associati alla catena di fornitura di prodotti e servizi ICT.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A5.22",
   "priority": null,
   "category": "Monitoraggio, revisione e gestione del cambiamento dei servizi dei fornitori",
   "sub_category": null,
   "description": "L'organizzazione ha monitorato, rivisto, valutato e gestito regolarmente i cambiamenti nelle pratiche di sicurezza delle informazioni dei fornitori e nell'erogazione dei servizi.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A5.23",
   "priority": null,
   "category": "Sicurezza delle informazioni per l'utilizzo dei servizi cloud",
   "sub_category": null,
   "description": "I processi di acquisizione, utilizzo, gestione e uscita dai servizi cloud sono stabiliti in conformità con i requisiti di sicurezza delle informazioni dell'organizzazione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 7,
   "framework": "ISO 27001",
   "code": "A6.6",
   "priority": null,
   "category": "Accordi di riservatezza e non divulgazione",
   "sub_category": null,
   "description": "Gli accordi di riservatezza o non divulgazione che riflettono le esigenze dell'organizzazione per la protezione delle informazioni sono identificati, documentati, regolarmente rivisti e firmati dal personale e da altre parti interessate rilevanti.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 8,
   "framework": "ISO 27001",
   "code": "A5.18",
   "priority": null,
   "category": "Diritti di accesso",
   "sub_category": null,
   "description": "I diritti di accesso alle informazioni e ad altre risorse associate sono forniti, rivisti, modificati e rimossi in conformità con la politica specifica dell'argomento e le regole per il controllo degli accessi dell'organizzazione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 8,
   "framework": "ISO 27001",
   "code": "A5.6",
   "priority": null,
   "category": "Contatti con gruppi specialistici",
   "sub_category": null,
   "description": "L'organizzazione ha stabilito e mantenuto contatti con gruppi di interesse particolari o altri forum specializzati in sicurezza e associazioni professionali.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 8,
   "framework": "ISO 27001",
   "code": "A8.20",
   "priority": null,
   "category": "Controlli di rete",
   "sub_category": null,
   "description": "Le reti e i dispositivi di rete sono protetti, gestiti e controllati per proteggere le informazioni nei sistemi e nelle applicazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 8,
   "framework": "ISO 27001",
   "code": "A8.21",
   "priority": null,
   "category": "Sicurezza dei servizi di rete",
   "sub_category": null,
   "description": "I meccanismi di sicurezza, i livelli di servizio e i requisiti di servizio dei servizi di rete sono identificati, implementati e monitorati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 9,
   "framework": "ISO 27001",
   "code": "6.1.2",
   "priority": null,
   "category": "Valutazione del rischio relativo alla sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha definito un processo di valutazione dei rischi per la sicurezza delle informazioni, identificando, analizzando e prioritizzando i rischi in base a criteri stabiliti, e ha mantenuto la documentazione relativa al processo.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 9,
   "framework": "ISO 27001",
   "code": "6.1.3",
   "priority": null,
   "category": "Trattamento del rischio relativo alla sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha applicato un processo per trattare i rischi della sicurezza delle informazioni, selezionando controlli adeguati, creando una Dichiarazione di Applicabilità e ottenendo l'approvazione del piano e dei rischi residui dai proprietari dei rischi. La documentazione viene conservata.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 9,
   "framework": "ISO 27001",
   "code": "9.1",
   "priority": null,
   "category": "Monitoraggio, misurazione, analisi e valutazione",
   "sub_category": null,
   "description": "L'organizzazione ha stabilito cosa e come monitorare nei processi di sicurezza delle informazioni, chi è responsabile e ha conservato la documentazione come prova, valutando anche le prestazioni e l'efficacia del sistema di gestione della sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 10,
   "framework": "ISO 27001",
   "code": "A6.3",
   "priority": null,
   "category": "Consapevolezza, istruzione, formazione e addestramento sulla sicurezza delle informazioni",
   "sub_category": null,
   "description": "Il personale e le parti interessate hanno ricevuto formazione e aggiornamenti regolari sulle politiche e procedure di sicurezza delle informazioni, rilevanti per le loro funzioni lavorative.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 10,
   "framework": "ISO 27001",
   "code": "A6.8",
   "priority": null,
   "category": "Segnalazione di eventi relativi alla sicurezza delle informazioni",
   "sub_category": null,
   "description": "L'organizzazione ha fornito un meccanismo che consenta al personale di segnalare tempestivamente eventi di sicurezza delle informazioni osservati o sospetti attraverso canali appropriati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 11,
   "framework": "ISO 27001",
   "code": "A5.31",
   "priority": null,
   "category": "Identificazione dei requisiti legali, statutari, regolamentari e contrattuali (crittografia)",
   "sub_category": null,
   "description": "I requisiti legali, statutari, normativi e contrattuali relativi alla sicurezza delle informazioni e l'approccio dell'organizzazione per soddisfare tali requisiti sono   identificati, documentati e mantenuti aggiornati.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 11,
   "framework": "ISO 27001",
   "code": "A8.24",
   "priority": null,
   "category": "Uso della crittografia",
   "sub_category": null,
   "description": "Vengono definite e attuate norme per l'uso efficace della crittografia, compresa la gestione delle chiavi crittografiche.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A5.16",
   "priority": null,
   "category": "Gestione dell'identità",
   "sub_category": null,
   "description": "Viene gestito l'intero ciclo di vita delle identità.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A5.17",
   "priority": null,
   "category": "Informazioni di autenticazione",
   "sub_category": null,
   "description": "L'assegnazione e la gestione delle informazioni di autenticazione sono controllate da un processo di gestione, inclusa la consulenza al personale sulla gestione adeguata delle informazioni di autenticazione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A6.1",
   "priority": null,
   "category": "Selezione del personale è Screening",
   "sub_category": null,
   "description": "I controlli di verifica dei precedenti sui candidati e sul personale esistente sono effettuati prima dell'assunzione e periodicamente, in conformità a leggi ed etica, proporzionati ai requisiti aziendali, alla classificazione delle informazioni e ai rischi percepiti.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A6.2",
   "priority": null,
   "category": "Termini e condizioni di lavoro",
   "sub_category": null,
   "description": "Gli accordi contrattuali di lavoro hanno stabilito le responsabilità del personale e dell'organizzazione per la sicurezza delle informazioni.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A6.5",
   "priority": null,
   "category": "Responsabilità dopo la cessazione o il cambio di rapporto di lavoro",
   "sub_category": null,
   "description": "Le responsabilità e i doveri in materia di sicurezza delle informazioni che rimangono validi dopo la cessazione o il cambio di rapporto di lavoro sono definiti, applicati e comunicati al personale interessato e alle altre parti interessate.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A8.2",
   "priority": null,
   "category": "Diritti di accesso privilegiato",
   "sub_category": null,
   "description": "L'assegnazione e l'uso dei diritti di accesso privilegiato sono limitati e gestiti.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A8.3",
   "priority": null,
   "category": "Limitazione dell'accesso alle informazioni",
   "sub_category": null,
   "description": "L'accesso alle informazioni e ad altre risorse associate viene limitato in conformità con la politica specifica per argomento stabilita sul controllo degli accessi.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 12,
   "framework": "ISO 27001",
   "code": "A8.5",
   "priority": null,
   "category": "Autenticazione sicura",
   "sub_category": null,
   "description": "Le tecnologie e le procedure di autenticazione sicura vengono implementate sulla base delle restrizioni di accesso alle informazioni e della politica specifica per argomento sul controllo degli accessi.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 15,
   "framework": "ISO 27001",
   "code": "6.2",
   "priority": null,
   "category": "Obiettivi per la sicurezza delle informazioni e pianificazione per conseguirli",
   "sub_category": null,
   "description": "L'organizzazione ha stabilito obiettivi di sicurezza delle informazioni, coerenti con la politica, misurabili, monitorati, comunicati e aggiornati. Viene mantenuta documentazione sugli obiettivi e, nella pianificazione, vengono definite azioni, risorse, responsabilità, tempistiche e metodi di valutazione.",
   "function": null,
   "asset_type": null
 },
 {
   "nis2_ref": 16,
   "framework": "ISO 27001",
   "code": "A5.14",
   "priority": null,
   "category": "Trasferimento di informazioni",
   "sub_category": null,
   "description": "Sono in vigore regole, procedure o accordi per il trasferimento delle informazioni per tutti i tipi di strutture di trasferimento all'interno dell'organizzazione e tra l'organizzazione e altre parti.",
   "function": null,
   "asset_type": null
 }
]
